# 1. За допомогою нескінченного циклу згенеруйте ряд чисел Фібоначчі. Ряд починається з чисел 1, 1, 2, 3, 5, 8, 13, а кожен наступний елемент - це сума двох попередніх.
print("1. За допомогою нескінченного(100 ітерацій) циклу згенеруйте ряд чисел Фібоначчі")
i=0
list=[1]
while True:
    if i > 100:
        print (list)
        break
    if i == 0:
        summ = list[i] + i
    else:
        summ=list[i]+list[i-1]
    list.append(summ)
    i+=1


# 2. Створіть список, що містить числа від 0 до 100 та за допомогою List Comprehension отримайте з нього список чисел, що кратні 3.
print("2. Створіть список, що містить числа від 0 до 100 та за допомогою List Comprehension отримайте з нього список чисел, що кратні 3")
list = [x for x in range(0,100) if x%3 == 0 and x != 0]
print(list)



# 3. Напишіть цикл for, який просить ввести ціле число 10 разів, а потім роздруковує у консолі суму всіх введених чисел.
print("3. Напишіть цикл for, який просить ввести ціле число 10 разів, а потім роздруковує у консолі суму всіх введених чисел.")
summ=0
for i in range(1,11):
    x=int(input(f"Введіть ціле число для {i} змінної:"))
    summ+=x
print(f"Сумма усіх введених чисел {summ}")


# 4. Напишіть нескінченний цикл, який просить ввести ціле число і переривається, якщо введене число менше 0.
print("4. Напишіть нескінченний цикл, який просить ввести ціле число і переривається, якщо введене число менше 0.")
while True:
    try:
        if int(input("Введіть ціле число:")) < 0:
            break
    except:
        print("Потрібно писати цілі числа.")


# 5. Напишіть код, який просить ввести дві будь-яких змінних, а потім міняє їх місцями.
print("5. Напишіть код, який просить ввести дві будь-яких змінних, а потім міняє їх місцями.")
x=input("Впищіть значення для змінної Х:")
y=input("Впищіть значення для змінної Y:")
print("А тепер оопля і змінні помінялися місцями")
x, y = y, x
print(f"x={x}")
print(f"y={y}")