import math

r=4
C=2*math.pi*r
print("1. Довжина кола = "+str(C))

row="My name is Python"
print("2. Довжина рядка = "+str(len(row)))

numbers = [1, 8, 5, 4, 12]
print('3. Cереднє значення чисел зі списку : '+str(sum(numbers)/len(numbers)))

# 4. Створіть словник, в якому ключами будуть назви ваших улюблених фільмів, а значеннями – оцінки цих фільмів на IMDB.
d = {'Назад у майбутнє': 8.5, 'ВОЛЛ-І': 8.4}
print("4. Словник з улюбленими фільмами: "+str(d))
#5. Створіть список з трьома будь-якими елементами. Роздрукуйте у консолі перший елемент.
numbers = [1, 8, 5]
print("5. Первый(нулевой) элемент списка:"+str(numbers[0]))
#6. Створіть рядок, який містить слово “python”. Роздрукуйте у консолі цей рядок великими буквами.
row="python"
print("6. “python” великими буквами: "+row.upper())
#7. За допомогою Python розрахуйте кількість бітів у кілобайті.
try:
    kbayt=int(input("7. Скільки кілобайт перерахувати у біти? : "))
    print("7. Розрахована кількість бітів: "+str(kbayt*8*1024))
except:
    print("Вводь ціле число.")
#8. Роздрукуйте у консолі рядок “P Y T H O N” без пробілів.
row="P Y T H O N"
print("8. “P Y T H O N” без пробілів: "+row.replace(" ",""))